Feature: Търсене на герой по име

Scenario: Търсене на герой с попълнени данни
    Given Потребителят се намира в прозореца за търсене на герои
    When Потребителят въведе име на герой "Gosho"
    And Натиска бутона за търсене
    Then Излиза съобщение "Героят е намерен успешно"

Scenario: Търсене на герой с попълнени невалидни данни
    Given Потребителят се намира в прозореца за търсене на герои
    When Потребителят въведе име на герой "Gosho132"
    And Натиска бутона за търсене
    Then Излиза съобщение "Героят не е намерен"